#include <stdio.h>                                                  //ประกาศไลบรารีสำหรับการใช้งาน printf

int main() {                                                        //ฟังก์ชันหลักของโปรแกรม
    int a = 5, b = 17;                                              //ประกาศตัวแปร a และ b เป็นชนิด int
    float c = 8.5, d = 4.0;                                         //ประกาศตัวแปร c และ d เป็นชนิด float
//1.แสดงค่าเริ่มต้นของตัวแปรทั้งหมด
    printf("Show all variables: a = 5, b = 17, c = 8.5, b = 17\n");           //ประกาศตัวแปร
//2.แสดงผลการคำนวณของ d + a    
    printf("d + a  = %.1f\n", d + a );                              // d บวก a ใช้กับ float ได้
//3.แสดงผลการคำนวณของ a - b
    printf("a - b  = %d\n", a - b);                                 // a ลบ b ใช้กับ int ได้
//4.แสดงผลการคำนวณของ c * d
    printf("c * d  = %.1f\n", c * d);                               // c คูณ d ใช้กับ float ได้
//5.แสดงผลการคำนวณของ a * c
    printf("a * c  = %.1f\n", a * c);                               // a คูณ c ใช้กับ float ได้
//6.แสดงผลการคำนวณของ c / d
    printf("c / d  = %.1f\n", c / d);                               // c หารด้วย d ไม่เอาเศษ เพราะ / ไม่เอาเศษ และใช้กับ float ได้
//7.แสดงผลการคำนวณของ b / c
    printf("b / c  = %d\n", b / c);                                 // b หารด้วย c ไม่เอาเศษ เพราะ / ไม่เอาเศษ และใช้กับ float ได้
//8.แสดงผลการคำนวณของ a % b
    printf("a %% b = %d\n", a % b);                                 //a หารด้วย b เอาแค่เศษ เพราะ % เอาแค่เศษ และใช่กับ int ได้
//9.แสดงผลการคำนวณของ c % a
    printf("((int)c) %% a = %d\n", ((int)c) % a);                   //แปลง c ให้เป็น int ก่อน เพราะ % ต้องใช้กับ int เท่านั้น
//10.แสดงผลการคำนวณของ c % d
    printf("((int)c) %% ((int)d) = %d\n", ((int)c) % ((int)d));     //แปลง c และ d ให้เป็น int ก่อน เพราะ % ต้องใช้กับ int เท่านั้น
  
    return 0;                                                       //คืนค่า 0 เพื่อบอกว่าทำงานสำเร็จแล้ว
}

//จากการทดลอง ข้อที่1-7 เมื่อเขียนโค้ดตามหัวข้อที่กำหนดในโจทย์ สามารถ run ได้ตามปกติ แต่ ข้อที่ 9-10 จะมีการแปลงชนิดข้อมูลเป็น int ก่อน เนื่องจาก % ใช้กับ int เท่านั้น
//ถ้าเราเขียนตามโจทย์ที่ให้มา ข้อที่9 ให้ c % a และ ข้อที่10 ให้ c % d จะไม่สามารถทำงานได้ เพราะ c และ d เป็น float แต่ % ใช้กับ int เท่านั้น ดังนั้นต้องแปลงเป็น int ก่อน
//ข้อที่ 8-10 จะมีการแสดงผลลัพธ์ที่เป็นเศษของการหารด้วย % ซึ่งจะต้องแปลงเป็น int ก่อนเพื่อให้สามารถใช้ % ได้