#include <stdio.h>                                              //ประกาศไลบรารีสำหรับการใช้งาน printf
int main() {                                                    //ฟังก์ชันหลักของโปรแกรม
int x = 12, y = 7, z= 12;                                       //ให้ ตัวแปล x = 12, y = 7, z= 12 ในรูปแบบ int
printf("\nx = 12, y = 7, z= 12\n\n");                           //แสดงค่าเริ่มต้นของตัวแปร x, y, z
if (x > y){                                                     //ตรวจสอบเงื่อนไข x > y
printf("1.\tx > y = true(1)\n");                                //แสดงผลลัพธ์ของเงื่อนไข x > y true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("1.\tx > y = false(0)\n");                               //แสดงผลลัพธ์ของเงื่อนไข x > y false(0)
}
if (x < z){                                                     //ตรวจสอบเงื่อนไข x < z
printf("2.\tx < z = true(1)\n");                                //แสดงผลลัพธ์ของเงื่อนไข x < z true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("2.\tx < z = false(0)\n");                               //แสดงผลลัพธ์ของเงื่อนไข x < z false(0)
}
if (x == z){                                                    //ตรวจสอบเงื่อนไข x == z
printf("3.\tx == z = true(1)\n");                               //แสดงผลลัพธ์ของเงื่อนไข x == z true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("3.\tx == z = false(0)\n");                              //แสดงผลลัพธ์ของเงื่อนไข x == z false(0)
}
if (x != y){                                                    //ตรวจสอบเงื่อนไข x != y
printf("4.\tx != y = true(1)\n");                               //แสดงผลลัพธ์ของเงื่อนไข x != y true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("4.\tx != y = false(0)\n");                              //แสดงผลลัพธ์ของเงื่อนไข x != y false(0)
}
if (!(2*5 >= y) || (5 != (5/3))){                               //ตรวจสอบเงื่อนไข !(2*5 >= y) || (5 != (5/3))
printf("5.\t!(2*5 >= y) || (5 != (5/3)) = true(1)\n");          //แสดงผลลัพธ์ของเงื่อนไข !(2*5 >= y) || (5 != (5/3)) true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("5.\t!(2*5 >= y) || (5 != (5/3)) = false(0)\n");         //แสดงผลลัพธ์ของเงื่อนไข !(2*5 >= y) || (5 != (5/3)) false(0)
}
if (!(x < y)){                                                  //ตรวจสอบเงื่อนไข !(x < y)
printf("6.\t!(x < y) = true(1)\n");                             //แสดงผลลัพธ์ของเงื่อนไข !(x < y) true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("6.\t!(x < y) = false(0)\n");                            //แสดงผลลัพธ์ของเงื่อนไข!(x < y) false(0)
}
if ((x + y) > (z*2)){                                           //ตรวจสอบเงื่อนไข (x + y) > (z*2)
printf("7.\t(x + y) > (z*2) = true(1)\n");                      //แสดงผลลัพธ์ของเงื่อนไข true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("7.\t(x + y) > (z*2) = false(0)\n");                     //แสดงผลลัพธ์ของเงื่อนไข false(0)
}
if ((x%2 == 0) || (y%2 == 1)){                                  //ตรวจสอบเงื่อนไข (x%2 == 0) || (y%2 == 1)
printf("8.\t(x%%2 == 0) || (y%%2 == 1) = true(1)\n");           //แสดงผลลัพธ์ของเงื่อนไข true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("8.\t(x%%2 == 0) || (y%%2 == 1) = false(0)\n");          //แสดงผลลัพธ์ของเงื่อนไข false(0)
}
if ((x>y) && (z<y)){                                            //ตรวจสอบเงื่อนไข (x>y) && (z<y)
printf("9.\t(x>y) && (z<y) = true(1)\n");                       //แสดงผลลัพธ์ของเงื่อนไข (x>y) && (z<y) true(1)
} else {                                                        //ถ้าเงื่อนไขไม่เป็นจริง
printf("9.\t(x>y) && (z<y) = false(0)\n\n");                    //แสดงผลลัพธ์ของเงื่อนไข (x>y) && (z<y) false(0)
}
return 0;                                                       //คืนค่า 0 เพื่อบอกว่าทำงานสำเร็จแล้ว
} 
