#include <stdio.h>                                              //ประกาศไลบรารีสำหรับการใช้งาน printf 


int main() {                                                    //ฟังก์ชันหลักของโปรแกรม
    int a, b, c, d, e, f, g;                                    //ให้ ตัวแปล a, b, c, d, e, f, g อยู่ในรูปแบบ int
    printf("A = %d\n",a = -2 + 5 *2);                           //แสดง ค่า A
    printf("B = %d\n",b = 10 / 2 * 3);                          //แสดง ค่า B
    printf("C = %d\n",c = 6 / 2 + 3 * (4 % 2));                 //แสดง ค่า C
    printf("D = %d\n",d = (5 + 2) * 15 % 4);                    //แสดง ค่า D
    printf("E = %d\n",e = 6 + 2 * 2 - 6 / 2);                   //แสดง ค่า E
    printf("F = %d\n",f = 5 + 3 * 2 - 8 / 4 + (6 % 5));         //แสดง ค่า F
    printf("G = %d\n",g = (4 + 3) * 2 - 10 / (2 + 3));          //แสดง ค่า G
    
    return 0;                                                   //คืนค่า 0 เพื่อบอกว่าทำงานสำเร็จแล้ว
}