#include <stdio.h>                                              //ประกาศไลบรารีสำหรับการใช้งาน printf
int main() {                                                    //ฟังก์ชันหลักของโปรแกรม
   printf("------------------------------\n\n");                //แสดงเส้นแบ่งเพื่อความชัดเจน
printf("w06-02-01\n\n");                                        //ชื่อโปรแกรม
printf("i, j, k\n\n");                                          //ประกาศตัวแปร i, j, k
    //บรรทัดที่1
    int i = 1, j = 2, k;                                        //ประกาศตัวแปร i, j และ k เป็นชนิด int
    printf("1.\ti = %d, j = %d, k =\n", i, j);                  //แสดงค่าเริ่มต้นของ i และ j
    //บรรทัดที่2                  
    k = i + j;                                                  //คำนวณค่า k เป็นผลรวมของ i และ j
    printf("2.\tk = i + j = %d,%d,%d\n", i, j, k);              //แสดงผลลัพธ์ของ k
    //บรรทัดที่3            
    i = i +(k * j);                                             //คำนวณค่า i ใหม่โดยใช้ k คูณ j
    printf("3.\ti = i +(k * j) = %d,%d,%d\n", i ,j, k);         //แสดงผลลัพธ์ของ i
    //บรรทัดที่4
    j = i / 2;                                                  //คำนวณค่า j เป็น i หารด้วย 2
    printf("4.\tj = i / 2 = %d,%d,%d\n", i, j, k);              //แสดงผลลัพธ์ของ j
    //บรรทัดที่5
    k = i % 2;                                                  //คำนวณค่า k เป็นเศษของ i หารด้วย 2
    printf("5.\tk = i %% 2 = %d,%d,%d\n", i, j, k);             //แสดงผลลัพธ์ของ k
    //บรรทัดที่6
    i = (j + k) * 3;                                            //คำนวณค่า i ใหม่โดยใช้ j บวก k และ คูณด้วย 3
    printf("6.\ti = (j + k) * 3 = %d,%d,%d\n\n", i, j, k);      //แสดงผลลัพธ์ของ i
printf("------------------------------\n\n");                   //แสดงเส้นแบ่งเพื่อความชัดเจน
printf("w06-02-02\n\n");                                        //ชื่อโปรแกรม
    printf("x, y, z\n\n");                                      //ประกาศตัวแปร x, y, z
    //บรรทัดที่1
    double x = 1.0, y = 2.0, z;                                 //ประกาศตัวแปร x, y และ z เป็นชนิด double 
    printf("1.\tx = %.1f, y = %.1f, z =\n", x, y);              //แสดงค่าเริ่มต้นของ x และ y
    //บรรทัดที่2
    x = y + 5.0;                                                //คำนวณค่า x เป็น y บวก 5.0
    printf("2.\tx = y + 5.0 = %.1f, %.1f\n", x, y);             //แสดงผลลัพธ์ของ x
    //บรรทัดที่3
    y = x / 2.0;                                                //คำนวณค่า y เป็น x หารด้วย 2.0
    printf("3.\ty = x / 2.0 = %.1f, %.1f\n", x, y);             //แสดงผลลัพธ์ของ y
    //บรรทัดที่4
    y = (x * 3.0) + 4.0;                                        //คำนวณค่า y เป็น x คูณ 3.0 บวก 4.0
    printf("4.\ty = (x * 3.0) + 4.0 = %.1f, %.1f\n", x, y);     //แสดงผลลัพธ์ของ y
    //บรรทัดที่5
    x = - 0.5 - y;                                              //คำนวณค่า x เป็น -0.5 ลบ y
    printf("5.\tx = - 0.5 - y = %.1f, %.1f\n", x, y);           //แสดงผลลัพธ์ของ x
    //บรรทัดที่6
    z = x + y;                                                  //คำนวณค่า z เป็นผลรวมของ x และ y
    printf("6.\tz = x + y = %.1f, %.1f, %.1f\n\n", x, y, z);    //แสดงผลลัพธ์ของ z
    printf("------------------------------\n\n");               //แสดงเส้นแบ่งเพื่อความชัดเจน
    return 0;                                                   //คืนค่า 0 เพื่อบอกว่าทำงานสำเร็จแล้ว
}

